var end=end||{};
end.Content=function(){
	var s = this;
	F2xMovieClip.call(s);
	s.initUI();
	s.more_btn.mouseChildren=false;
	s.submit_btn.mouseChildren=false;
	if(localStorage.name){
		s.name_mc.name_txt.setText(localStorage.name);
		s.submit_btn.gotoAndStop(2);
		s.tip_mc.gotoAndStop(2);
	}
	if(localStorage.phone){
		s.phone_mc.phone_txt.setText(localStorage.phone);
	}
	s.addEventListener(annie.MouseEvent.MOUSE_UP,function (e) {
		if(e.target.name=="submit_btn"){
			if(e.target.currentFrame==1){
				//检测
				var name=s.name_mc.name_txt.getText();
				var phone=s.phone_mc.phone_txt.getText();
				if(name==""||name.length>50){
					alert("请填写合适的姓名!");
					return;
				}
				if(phone.length!=11){
					alert("请填写正确的手机号!");
					return;
				}
				e.target.nextFrame();
				e.target.mouseEnable=false;
				s.tip_mc.gotoAndStop(2);
				setTimeout(function (){
					e.target.mouseEnable=true;
				},1000);
				//提交数据
				sendCount("提交资料");
				Flash2x.ajax({url:serverUrl+"Home/Index/savePeopleInfo",type:"post",responseType:"json",data:{name:s.name_mc.name_txt.getText(),phonenumber:s.phone_mc.phone_txt.getText()},success:function() {
					trace("提交成功");
					//将信息存起来
					localStorage.name=name;
					localStorage.phone=phone;
				}})
			}else{
				//再来一次
				sendCount("再玩一次");
				globalDispatcher.dispatchEvent("onOnceAgain");
			}
		}else if(e.target.name=="more_btn"){
			s.name_mc.visible=false;
			s.phone_mc.visible=false;
			s.dispatchEvent("onShowMore");
			sendCount("详细信息");
		}
	})
};
F2xExtend(end.Content,F2xMovieClip);
end.Content.prototype.initUI=function(){
	var s = this;
	//f2x_auto_created_init_start
	var _d0=new end.F2xAuto_38();
	var _d1=new end.F2xAuto_46();
	_d1.name="more_btn";
	s.more_btn=_d1;
	var _d2=new end.F2xAuto_44();
	_d2.name="submit_btn";
	s.submit_btn=_d2;
	var _d3=new end.F2xAuto_43();
	_d3.name="tip_mc";
	s.tip_mc=_d3;
	var _d4=new end.F2xAuto_42();
	_d4.name="phone_mc";
	s.phone_mc=_d4;
	var _d5=new end.F2xAuto_41();
	_d5.name="name_mc";
	s.name_mc=_d5;
	var _d6=new end.F2xAuto_19();
	var _d7=new end.F2xAuto_18();
	var _d8=new end.F2xAuto_17();
	var _d9=new end.F2xAuto_40();
	var _d10=new end.F2xAuto_45();
	var _d11=new end.F2xAuto_48();
	s.a().b(22).b(1).c(_d0,{x:96,y:822,o:0}).b(1).c(_d0,{x:96,y:817.85,o:0.1367}).b(1).c(_d0,{x:96,y:814.05,o:0.2656}).b(1).c(_d0,{x:96,y:810.5,o:0.3828}).b(1).c(_d0,{x:96,y:807.3,o:0.4883}).b(1).c(_d0,{x:96,y:804.4,o:0.5859}).b(1).c(_d0,{x:96,y:801.8,o:0.6719}).b(1).c(_d0,{x:96,y:799.5,o:0.75}).b(1).c(_d0,{x:96,y:797.5,o:0.8164}).b(1).c(_d0,{x:96,y:795.85,o:0.8711}).b(1).c(_d0,{x:96,y:794.45,o:0.918}).b(1).c(_d0,{x:96,y:793.4,o:0.9531}).b(1).c(_d0,{x:96,y:792.6,o:0.9805}).b(1).c(_d0,{x:96,y:792.15,o:0.9961}).b(1).c(_d0,{x:96,y:792});
	s.a().b(20).b(1).c(_d1,{x:312,y:704,o:0}).b(1).c(_d1,{x:312,y:693.4,o:0.2656}).b(1).c(_d1,{x:312,y:684.4,o:0.4883}).b(1).c(_d1,{x:312,y:677.05,o:0.6719}).b(1).c(_d1,{x:312,y:671.35,o:0.8164}).b(1).c(_d1,{x:312,y:667.25,o:0.918}).b(1).c(_d1,{x:312,y:664.8,o:0.9805}).b(1).c(_d1,{x:312,y:664}).b(1).c(_d1,{x:312,y:666.65}).b(1).c(_d1,{x:312,y:668.9}).b(1).c(_d1,{x:312,y:670.75}).b(1).c(_d1,{x:312,y:672.15}).b(1).c(_d1,{x:312,y:673.2}).b(1).c(_d1,{x:312,y:673.8}).b(3).c(_d1,{x:312,y:674});
	s.a().b(18).b(1).c(_d2,{x:139,y:704,o:0}).b(1).c(_d2,{x:139,y:693.4,o:0.2656}).b(1).c(_d2,{x:139,y:684.4,o:0.4883}).b(1).c(_d2,{x:139,y:677.05,o:0.6719}).b(1).c(_d2,{x:139,y:671.35,o:0.8164}).b(1).c(_d2,{x:139,y:667.25,o:0.918}).b(1).c(_d2,{x:139,y:664.8,o:0.9805}).b(1).c(_d2,{x:139,y:664}).b(1).c(_d2,{x:139,y:666.65}).b(1).c(_d2,{x:139,y:668.9}).b(1).c(_d2,{x:139,y:670.75}).b(1).c(_d2,{x:139,y:672.15}).b(1).c(_d2,{x:139,y:673.2}).b(1).c(_d2,{x:139,y:673.8}).b(5).c(_d2,{x:139,y:674});
	s.a().b(16).b(1).c(_d3,{x:46,y:581,o:0}).b(1).c(_d3,{x:67.2,y:581,o:0.2656}).b(1).c(_d3,{x:85.2,y:581,o:0.4883}).b(1).c(_d3,{x:99.9,y:581,o:0.6719}).b(1).c(_d3,{x:111.3,y:581,o:0.8164}).b(1).c(_d3,{x:119.45,y:581,o:0.918}).b(1).c(_d3,{x:124.35,y:581,o:0.9805}).b(1).c(_d3,{x:126,y:581}).b(1).c(_d3,{x:128.65,y:581}).b(1).c(_d3,{x:130.9,y:581}).b(1).c(_d3,{x:132.75,y:581}).b(1).c(_d3,{x:134.15,y:581}).b(1).c(_d3,{x:135.2,y:581}).b(1).c(_d3,{x:135.8,y:581}).b(7).c(_d3,{x:136,y:581});
	s.a().b(14).b(1).c(_d4,{x:258,y:497,o:0}).b(1).c(_d4,{x:234.1,y:497,o:0.2656}).b(1).c(_d4,{x:213.9,y:497,o:0.4883}).b(1).c(_d4,{x:197.4,y:497,o:0.6719}).b(1).c(_d4,{x:184.55,y:497,o:0.8164}).b(1).c(_d4,{x:175.35,y:497,o:0.918}).b(1).c(_d4,{x:169.85,y:497,o:0.9805}).b(1).c(_d4,{x:168,y:497}).b(1).c(_d4,{x:165.35,y:497}).b(1).c(_d4,{x:163.1,y:497}).b(1).c(_d4,{x:161.25,y:497}).b(1).c(_d4,{x:159.85,y:497}).b(1).c(_d4,{x:158.8,y:497}).b(1).c(_d4,{x:158.2,y:497}).b(9).c(_d4,{x:158,y:497});
	s.a().b(12).b(1).c(_d5,{x:57,y:445,o:0}).b(1).c(_d5,{x:80.9,y:445,o:0.2656}).b(1).c(_d5,{x:101.1,y:445,o:0.4883}).b(1).c(_d5,{x:117.6,y:445,o:0.6719}).b(1).c(_d5,{x:130.45,y:445,o:0.8164}).b(1).c(_d5,{x:139.65,y:445,o:0.918}).b(1).c(_d5,{x:145.15,y:445,o:0.9805}).b(1).c(_d5,{x:147,y:445}).b(1).c(_d5,{x:149.65,y:445}).b(1).c(_d5,{x:151.9,y:445}).b(1).c(_d5,{x:153.75,y:445}).b(1).c(_d5,{x:155.15,y:445}).b(1).c(_d5,{x:156.2,y:445}).b(1).c(_d5,{x:156.8,y:445}).b(11).c(_d5,{x:157,y:445});
	s.a().b(10).b(1).c(_d6,{x:295,y:373.5,o:0}).b(1).c(_d6,{x:268.45,y:373.5,o:0.2656}).b(1).c(_d6,{x:246,y:373.5,o:0.4883}).b(1).c(_d6,{x:227.65,y:373.5,o:0.6719}).b(1).c(_d6,{x:213.35,y:373.5,o:0.8164}).b(1).c(_d6,{x:203.15,y:373.5,o:0.918}).b(1).c(_d6,{x:197.05,y:373.5,o:0.9805}).b(1).c(_d6,{x:195,y:373.5}).b(1).c(_d6,{x:195,y:373.5}).b(1).c(_d6,{x:195,y:373.5}).b(1).c(_d6,{x:195,y:373.5}).b(1).c(_d6,{x:195,y:373.5}).b(1).c(_d6,{x:195,y:373.5}).b(1).c(_d6,{x:195,y:373.5}).b(13).c(_d6,{x:195,y:373.5});
	s.a().b(8).b(1).c(_d7,{x:53,y:336,o:0}).b(1).c(_d7,{x:82.2,y:336,o:0.2656}).b(1).c(_d7,{x:106.9,y:336,o:0.4883}).b(1).c(_d7,{x:127.1,y:336,o:0.6719}).b(1).c(_d7,{x:142.8,y:336,o:0.8164}).b(1).c(_d7,{x:154,y:336,o:0.918}).b(1).c(_d7,{x:160.75,y:336,o:0.9805}).b(1).c(_d7,{x:163,y:336}).b(1).c(_d7,{x:160.35,y:336}).b(1).c(_d7,{x:158.1,y:336}).b(1).c(_d7,{x:156.25,y:336}).b(1).c(_d7,{x:154.85,y:336}).b(1).c(_d7,{x:153.8,y:336}).b(1).c(_d7,{x:153.2,y:336}).b(15).c(_d7,{x:153,y:336});
	s.a().b(6).b(1).c(_d8,{x:310.5,y:298,o:0}).b(1).c(_d8,{x:281.3,y:298,o:0.2656}).b(1).c(_d8,{x:256.6,y:298,o:0.4883}).b(1).c(_d8,{x:236.4,y:298,o:0.6719}).b(1).c(_d8,{x:220.7,y:298,o:0.8164}).b(1).c(_d8,{x:209.5,y:298,o:0.918}).b(1).c(_d8,{x:202.75,y:298,o:0.9805}).b(1).c(_d8,{x:200.5,y:298}).b(1).c(_d8,{x:203.15,y:298}).b(1).c(_d8,{x:205.4,y:298}).b(1).c(_d8,{x:207.25,y:298}).b(1).c(_d8,{x:208.65,y:298}).b(1).c(_d8,{x:209.7,y:298}).b(1).c(_d8,{x:210.3,y:298}).b(17).c(_d8,{x:210.5,y:298});
	s.a().b(3).b(1).c(_d9,{x:197.5,y:383.25,a:0.5,b:0.5,o:0}).b(1).c(_d9,{x:161.75,y:347.3,a:0.6459,b:0.6459,o:0.2656}).b(1).c(_d9,{x:131.5,y:316.85,a:0.7694,b:0.7694,o:0.4883}).b(1).c(_d9,{x:106.75,y:291.95,a:0.8704,b:0.8704,o:0.6719}).b(1).c(_d9,{x:87.5,y:272.6,a:0.949,b:0.949,o:0.8164}).b(1).c(_d9,{x:73.75,y:258.75,a:1.0051,b:1.0051,o:0.918}).b(1).c(_d9,{x:65.5,y:250.4,a:1.0388,b:1.0388,o:0.9805}).b(1).c(_d9,{x:62.75,y:247.65,a:1.05,b:1.05}).b(1).c(_d9,{x:66,y:250.9,a:1.0367,b:1.0367}).b(1).c(_d9,{x:68.8,y:253.65,a:1.0255,b:1.0255}).b(1).c(_d9,{x:71,y:255.9,a:1.0163,b:1.0163}).b(1).c(_d9,{x:72.75,y:257.7,a:1.0092,b:1.0092}).b(1).c(_d9,{x:74,y:258.95,a:1.0041,b:1.0041}).b(1).c(_d9,{x:74.75,y:259.7,a:1.001,b:1.001}).b(20).c(_d9,{x:75,y:260});
	s.a().b(1).c(_d10,{x:67,y:159,o:0}).b(1).c(_d10,{x:67,y:148.4,o:0.2656}).b(1).c(_d10,{x:67,y:139.4,o:0.4883}).b(1).c(_d10,{x:67,y:132.05,o:0.6719}).b(1).c(_d10,{x:67,y:126.35,o:0.8164}).b(1).c(_d10,{x:67,y:122.25,o:0.918}).b(1).c(_d10,{x:67,y:119.8,o:0.9805}).b(1).c(_d10,{x:67,y:119}).b(1).c(_d10,{x:67,y:121.65}).b(1).c(_d10,{x:67,y:123.9}).b(1).c(_d10,{x:67,y:125.75}).b(1).c(_d10,{x:67,y:127.15}).b(1).c(_d10,{x:67,y:128.2}).b(1).c(_d10,{x:67,y:128.8}).b(23).c(_d10,{x:67,y:129});
	s.a().b(1).c(_d11,{x:-86,o:0}).b(1).c(_d11,{x:-86,o:0.2656}).b(1).c(_d11,{x:-86,o:0.4883}).b(1).c(_d11,{x:-86,o:0.6719}).b(1).c(_d11,{x:-86,o:0.8164}).b(1).c(_d11,{x:-86,o:0.918}).b(1).c(_d11,{x:-86,o:0.9805}).b(30).c(_d11,{x:-86});
	s.as(function(){this.stop();}.bind(this),36);
	//f2x_auto_created_init_end
	
};
